fun main() {
    val count = 9

    print("""
        |$count * 1 = ${count*1}
        |$count * 2 = ${count*2}
        |$count * 3 = ${count*3}
        |$count * 4 = ${count*4}
        |$count * 5 = ${count*5}
        |$count * 6 = ${count*6}
        |$count * 7 = ${count*7}
        |$count * 8 = ${count*8}
        |$count * 9 = ${count*9}

    """.trimMargin())

    /*
    Задача 3 к Уроку 3

Пишем программу, которая будет помогать учить таблицу умножения.
В отдельную переменную будет записываться число (объявить и проинициализировать),
а выводиться будет таблица умножения для этого числа.
Таблица должна корректно печататься, если в исходную переменную подставлять разные числа.

Пример вывода:
6 x 1 = 6
6 x 2 = 12
…
6 x 9 = 54

 – Вместо числа 6 использовать данные из объявленной переменной;
 – Вычислять значения прямо в строке;
 – Вывод всей таблицы нужно сделать в одной функции println(), которая вызывается один раз.
     */
}