package Lesson_1_to_10

fun main() {

    val firstName = "Татьяна"
    var secondName = "Андреева"
    val middleName = "Сергеевна"

    var age = 20
    println("$secondName $firstName $middleName, $age лет")

    age = 22
    secondName = "Сидорова"
    println("$secondName $firstName $middleName, $age года")


    /*
    Задача 2 к Уроку 3

Девушка по имени Андреева Татьяна Сергеевна в 22 года вышла замуж за Сидорова, и поменяла фамилию.
О ней есть запись в одном из государственных приложений. Приложение отслеживает изменения персональных данных граждан.

Выведи в консоль данные на момент когда ей было 20 и на момент когда ей было 22 в формате [ФИО, возраст].
Все части ФИО и возраст изначально хранятся в отдельных переменных.
     */
}